diagramas/3.3-teste-beta.mmd
classDiagram
    class UsuarioFinal {
        <<ator>>
        +usarAppNoProprioDispositivo() void
    }

    class AppBeta {
        +reproduzir() void
        +enviarTelemetria() void
    }

    class ApiGateway {
        <<service>>
        +rotearCanario() void
    }

    class TelemetriaCampo {
        <<ambiente>>
        +registrarCrash(evento) void
        +registrarQoE(metricas) void
    }

    UsuarioFinal --> AppBeta : Android iOS SmartTV
    AppBeta --> ApiGateway : producao restrita
    AppBeta --> TelemetriaCampo : falhas reais
